<?php 
$I = new AcceptanceTester($scenario);
$I->wantTo('проверить что сайт живой и меню работает');

//Домашняя
$I->amOnPage("/");
$I->see("Новости из лаборатории");
$I->see("Последние статьи");

//Меню

$I->click("Технологии");
$I->see("Технологии","span");

$I->click("Известные роботы");
$I->see("Известные роботы","span");

$I->click("Новые технологии");
$I->see("Новые технологии","span");

$I->click("Новые технологии");
$I->see("Новые технологии","span");

$I->click("Статьи");
$I->see("Статьи","span");

$I->click("Электроника и Arduino");
$I->see("Электроника и Arduino","span");

$I->click("AI и компьютерное зрение");
$I->see("AI и компьютерное зрение","span");

$I->click("Синтез звука и голоса, MIDI");
$I->see("Синтез звука и голоса, MIDI","span");

$I->click("Умный дом и гаджеты");
$I->see("Умный дом и гаджеты","span");

$I->click("Механика");
$I->see("Механика","span");

$I->click("Основы электроники");
$I->see("Основы электроники","span");

$I->click("Математика и алгоритмы");
$I->see("Математика и алгоритмы","span");


$I->click("Программы для разработчиков");
$I->see("Программы для разработчиков","span");

$I->click("Лаборатория");
$I->see("Лаборатория","span");

$I->click("Игровой контроллер на MPU-6050");
$I->see("Игровой контроллер на MPU-6050","span");

$I->click("MIDI-контроллер для Guitar Rig");
$I->see("MIDI-контроллер для Guitar Rig","span");

$I->click("Доработка и ремонт");
$I->see("Доработка и ремонт","span");

$I->click("Блог RoboZap");
$I->see("Блог RoboZap","span");

$I->click("Форум");
$I->see("Оглавление","span");

